app/controllers/users/omniauth_callbacks_controller.rb

  def google_oauth2

    auth_info = request.env["omniauth.auth"].info

    unless Rearview::User.valid_email?(auth_info['email'].to_s)
      return redirect_to(new_session_path, :flash => {
        :error => "Invalid Google domain for email #{auth_info['email'].to_s}. Please use your hungrymachine.com or livingsocial.com account."
      })
    end

    user = Rearview::User.find_or_create_by_email(auth_info['email'])
---
INSERT INTO `users` (`created_at`, `email`, `preferences`, `updated_at`) VALUES ('2013-12-13 18:02:53', 'trent.albright@hungrymachine.com', 'null', '2013-12-13 18:02:53')
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'trent.albright@hungrymachine.com' ORDER BY `users`.`id` ASC LIMIT 1